
# 地域区分とそれを構成する都道府県
# REGION_PREFS = {
#     "hokkaido": ["北海道"],
#     "tohoku": ["青森県", "秋田県", "岩手県", "山形県", "宮城県", "福島県"],
#     "kanto": ["東京都", "埼玉県", "神奈川県", "千葉県", "群馬県", "栃木県", "茨城県"],
#     "hokuriku": ["新潟県", "富山県", "福井県", "石川県"],
#     "chubu": ["山梨県", "長野県", "静岡県", "岐阜県", "愛知県"],
#     "kinki": ["滋賀県", "京都府", "大阪府", "兵庫県", "三重県", "奈良県", "和歌山県"],
#     "chugoku": ["岡山県", "鳥取県", "広島県", "島根県", "山口県"],
#     "shikoku": ["香川県", "愛媛県", "徳島県", "高知県"],
#     "kyushu": ["福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県"]
# }

REGION_PREFS = {
    "北海道": ["北海道"],
    "東北": ["青森県", "秋田県", "岩手県", "山形県", "宮城県", "福島県"],
    "関東": ["東京都", "埼玉県", "神奈川県", "千葉県", "群馬県", "栃木県", "茨城県"],
    "北陸": ["新潟県", "富山県", "福井県", "石川県"],
    "中部": ["山梨県", "長野県", "静岡県", "岐阜県", "愛知県"],
    "近畿": ["滋賀県", "京都府", "大阪府", "兵庫県", "三重県", "奈良県", "和歌山県"],
    "中国": ["岡山県", "鳥取県", "広島県", "島根県", "山口県"],
    "四国": ["香川県", "愛媛県", "徳島県", "高知県"],
    "九州": ["福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県"]
}

# 地域区分ごとの、属する計算区分
# CALC_SEGMENT = {
#     "hokkaido": "hokkaido",
#     "tohoku": "honshu",
#     "chubu": "honshu",
#     "hokuriku": "honshu",
#     "kanto": "honshu",
#     "kinki": "honshu",
#     "chugoku": "honshu",
#     "shikoku": "shikoku",
#     "kyushu": "kyushu"
# }

# 計算区分を構成する地域
# CALC_SEGMENT_REGIONS = {
#     "hokkaido": ["hokkaido"],
#     "honshu": ["tohoku", "kanto", "hokuriku", "chubu", "kinki", "chugoku"],
#     "shikoku": ["shikoku"],
#     "kyushu": ["kyushu"]
# }

# 計算区分を構成する地域
CALC_SEGMENT_REGIONS = {
    "北海道": ["北海道"],
    "本州": ["東北", "関東", "北陸", "中部", "近畿", "中国"],
    "四国": ["四国"],
    "九州": ["九州"]
}

# # 地域ごとの漢字表記
# REGION_KANJI = {
#     "hokkaido": "北海道",
#     "tohoku": "東北",
#     "chubu": "中部",
#     "kanto": "関東",
#     "hokuriku": "北陸",
#     "kinki": "近畿",
#     "chugoku": "中国",
#     "shikoku": "四国",
#     "kyushu": "九州",
#     "zenkoku": "全国"
# }
